"""1 Задание. Код с использованием for:
Запросить целое число, после чего вывести на экран все числа от 0 до введенного числа включительно через цикл for.
Функция range(n + 1) возвращает последовательность чисел от 0 до n включительно. Значение i поочередно принимает
каждое из чисел этой последовательности, и для каждого из них выполняется команда print(i).

2 Задание. Код с использованием while:
Программа делает то же самое, что и предыдущая, но использует цикл while вместо цикла for.
Переменная i инициализируется значением 0, а затем на каждой итерации цикла проверяется условие i <= n.
Если оно выполнено, то на экран выводится текущее значение переменной i, после чего значение i увеличивается на 1.
Цикл продолжается, пока i не станет больше n."""