"""Функция берёт на вход строку и возвращает true, если она является палиндромом и false в противном случае.
Напишите и вызовете для себя или какого-нибудь персонажа функцию, которая берёт на вход имя, фамилию, отчество
и возраст и возвращает строку вида “Иванов Иван Иванович 1973 г.р. зарегистрирован”.
Напишите функцию, которая берёт на вход 2 или 3 натуральных числа и возвращает их максимум.
Встроенным методом max() пользоваться нельзя Возможно, вам потребуется указать аргумент по умолчанию.
"""